Repository: Liptee/HSIViewer
Catalog: HSIView/*.lproj/Localizable.strings
Languages: ru

# common.cancel
source: Cancel
ru: Отмена

# common.done
source: Done
ru: Готово

# common.remove
source: Remove
ru: Удалить

# common.open
source: Open
ru: Открыть

# common.ok
source: OK
ru: ОК

# common.apply
source: Apply
ru: Применить

# common.save
source: Save
ru: Сохранить

# units.nm
source: nm
ru: нм

# units.size.gb
source: %.2f GB
ru: %.2f ГБ

# units.size.mb
source: %.1f MB
ru: %.1f МБ

# content_view.open_cube
source: Open a hyperspectral cube
ru: Откройте ГСИ

# menu.access_manager
source: Access Manager…
ru: Управление доступами…

# menu.assemble_hsi
source: Assemble HSI
ru: Собрать ГСИ

# menu.create_from_current
source: Create from Current
ru: Создать из текущего

# menu.export
source: Export…
ru: Экспорт…

# menu.graph
source: Graph
ru: График

# menu.grid_library
source: Grid Library
ru: Grid-библиотека

# menu.language
source: Language
ru: Язык

# menu.language.english
source: English
ru: Английский

# menu.language.russian
source: Russian
ru: Русский

# menu.language.system
source: System
ru: Системный

# menu.main_window
source: Main Window
ru: Основное окно

# menu.open
source: Open…
ru: Открыть…

# menu.import_mask
source: Import Mask…
ru: Импорт маски…

# menu.propagate_processing
source: Propagate Processing
ru: Распространить обработку

# menu.propagate_wavelengths
source: Propagate Wavelengths
ru: Распространить длины волн

# menu.show_left_panel
source: Show Left Panel
ru: Показать левую панель

# menu.show_right_panel
source: Show Right Panel
ru: Показать правую панель

# library.title
source: Library
ru: Библиотека

# library.drop_release_to_add
source: Drop to add
ru: Отпустите, чтобы добавить

# library.empty_hint
source: Drag .mat, .tiff, .npy, or .dat files here to add them to the library. Double-click an item to open the cube.
ru: Перетащи файлы .mat, .tiff, .npy или .dat сюда, чтобы добавить их в библиотеку. Двойной клик по элементу — открыть куб.

# library.rename_cube.title
source: Rename Cube
ru: Переименовать куб

# library.rename_cube.field_name
source: Name
ru: Название

# library.rename_cube.message
source: Enter a new name for the selected cube.
ru: Введите новое имя для выбранного куба.

# library.context.copy_processing
source: Copy Processing
ru: Копировать обработку

# library.context.paste_processing
source: Paste Processing
ru: Вставить обработку

# library.context.copy_wavelengths
source: Copy Wavelengths
ru: Копировать длины волн

# library.context.paste_wavelengths
source: Paste Wavelengths
ru: Вставить длины волн

# library.context.paste_point
source: Paste Point
ru: Вставить точку

# library.context.paste_area
source: Paste Area
ru: Вставить область

# library.context.rename
source: Rename…
ru: Переименовать…

# library.context.remove_from_library
source: Remove from Library
ru: Удалить из библиотеки

# library.wavelength.unset
source: lambda: range not set
ru: λ: диапазон не задан

# library.wavelength.single
source: lambda: %.1f nm • %d channel(s)
ru: λ: %.1f нм • %d канал(ов)

# library.wavelength.range
source: lambda: %.1f - %.1f nm • %d channel(s)
ru: λ: %.1f – %.1f нм • %d канал(ов)

# grid.title
source: Grid Library
ru: Grid-библиотека

# grid.sidebar.hsi
source: HSI
ru: ГСИ

# grid.sidebar.release_to_import
source: Drop to import
ru: Отпустите для импорта

# grid.sidebar.empty_library
source: Drag .mat, .tiff, .npy, or .dat files to add HSI data to the library.
ru: Перетащите файлы .mat, .tiff, .npy или .dat, чтобы добавить ГСИ в библиотеку.

# grid.sidebar.all_assigned
source: All entries are already placed in the grid. Remove an item from a cell or delete a row/column to return it to this list.
ru: Все элементы размещены в Grid-таблице. Удалите элемент из ячейки или удалите ряд/столбец, чтобы вернуть его в список.

# grid.header.counts
source: %d row(s) • %d column(s)
ru: %d ряд(ов) • %d столбец(ов)

# grid.empty_state.title
source: Table is not ready yet
ru: Таблица пока не готова

# grid.create_row
source: Create Row
ru: Создать ряд

# grid.create_column
source: Create Column
ru: Создать столбец

# grid.help.add_column
source: Add column
ru: Добавить столбец

# grid.help.add_row
source: Add row
ru: Добавить ряд

# grid.add_row
source: Add Row
ru: Добавить ряд

# grid.context.rename
source: Rename…
ru: Переименовать…

# grid.context.move_left
source: Move Left
ru: Сдвинуть влево

# grid.context.move_right
source: Move Right
ru: Сдвинуть вправо

# grid.context.move_up
source: Move Up
ru: Сдвинуть вверх

# grid.context.move_down
source: Move Down
ru: Сдвинуть вниз

# grid.context.delete_column
source: Delete Column
ru: Удалить столбец

# grid.context.delete_row
source: Delete Row
ru: Удалить ряд

# grid.context.return_to_library
source: Return to Library
ru: Вернуть в библиотеку

# grid.cell.empty
source: Empty
ru: Пусто

# grid.rename_row.title
source: Rename Row
ru: Переименовать ряд

# grid.rename_row.field_name
source: Row Name
ru: Название ряда

# grid.rename_row.message
source: Enter a new row name.
ru: Введите новое имя ряда.

# grid.rename_column.title
source: Rename Column
ru: Переименовать столбец

# grid.rename_column.field_name
source: Column Name
ru: Название столбца

# grid.rename_column.message
source: Enter a new column name.
ru: Введите новое имя столбца.

# grid.row.default_name
source: Row %d
ru: Ряд %d

# grid.column.default_name
source: Column %d
ru: Столбец %d

# window.graph.title
source: Graph
ru: График

# window.grid_library.title
source: Grid Library
ru: Grid-библиотека

# window.assembler.title
source: Assembler
ru: Сборщик

# access.title
source: Access Manager
ru: Управление доступами

# access.empty.saved_none
source: No saved access entries
ru: Нет сохранённых доступов

# access.empty.add_hint
source: Add a folder to avoid repeated access prompts
ru: Добавьте папку, чтобы избежать повторных запросов доступа

# access.status.active
source: Access active
ru: Доступ активен

# access.status.lost
source: Access lost
ru: Доступ утрачен

# access.add_folder
source: Add Folder…
ru: Добавить папку…

# access.alert.save_failed.title
source: Failed to save access
ru: Не удалось сохранить доступ

# access.alert.save_failed.message
source: Try selecting another folder or check access permissions.
ru: Попробуйте выбрать другую папку или проверьте права доступа.

# access.panel.select_folder.message
source: Select a folder to keep permanent access
ru: Выберите папку, к которой нужно сохранить постоянный доступ

# access.panel.select_folder.prompt_add
source: Add
ru: Добавить

# datatype.title
source: Data Type
ru: Тип данных

# datatype.current_type
source: Current type: %@
ru: Текущий тип: %@

# datatype.convert_to
source: Convert to:
ru: Преобразовать в:

# datatype.scaling
source: Scaling:
ru: Масштабирование:

# datatype.scaling.auto
source: Automatic
ru: Автоматическое

# datatype.scaling.auto_hint
source: Data will be scaled to target type range
ru: Данные будут масштабированы в диапазон целевого типа

# datatype.scaling.clamp_hint
source: Values will be clamped
ru: Значения будут обрезаны (clamped)

# datatype.memory_size
source: Memory size
ru: Размер в памяти

# datatype.after_conversion
source: After conversion
ru: После конвертации

# datatype.change
source: Change
ru: Изменение

# imageinfo.title
source: Image Info
ru: Информация об изображении

# imageinfo.format
source: Format
ru: Формат

# imageinfo.data_type
source: Data type
ru: Тип данных

# imageinfo.kind
source: Type
ru: Тип

# imageinfo.kind.2d
source: 2D image
ru: 2D изображение

# imageinfo.size
source: Size
ru: Размер

# imageinfo.resolution
source: Resolution
ru: Разрешение

# imageinfo.channels
source: Channels
ru: Каналы

# imageinfo.min_value
source: Min value
ru: Мин. значение

# imageinfo.max_value
source: Max value
ru: Макс. значение

# imageinfo.mean_value
source: Mean
ru: Среднее

# imageinfo.std_dev
source: Std. dev.
ru: Станд. откл.

# imageinfo.memory_size
source: Memory size
ru: Размер в памяти

# imageinfo.geo.crs
source: CRS
ru: Система координат

# imageinfo.geo.pixel_size
source: Pixel size
ru: Размер пикселя

# imageinfo.geo.rotation
source: Rotation
ru: Поворот

# imageinfo.geo.cursor_pixel
source: Cursor pixel
ru: Пиксель курсора

# imageinfo.geo.map_x
source: Map X
ru: X карты

# imageinfo.geo.map_y
source: Map Y
ru: Y карты

# imageinfo.geo.longitude
source: Longitude
ru: Долгота

# imageinfo.geo.latitude
source: Latitude
ru: Широта

# mat.select_variable.title
source: Select variable to import
ru: Выберите переменную для импорта

# normalization.title
source: Normalization
ru: Нормализация

# normalization.type
source: Type
ru: Тип

# normalization.precision
source: Precision:
ru: Точность:

# normalization.float32_result_hint
source: Normalization result will be saved as Float32
ru: Результат нормализации будет сохранён в Float32

# normalization.parameters
source: Parameters:
ru: Параметры:

# normalization.source_range
source: Source range:
ru: Исходный диапазон:

# normalization.target_range
source: Target range:
ru: Новый диапазон:

# normalization.lower_percent
source: Lower %:
ru: Нижний %:

# normalization.upper_percent
source: Upper %:
ru: Верхний %:

# rangewide.title
source: Color synthesis ranges
ru: Диапазоны цветосинтеза

# rangewide.wavelengths_unavailable
source: Wavelengths are unavailable — set channel ranges with the slider.
ru: Длины волн недоступны — задавайте диапазоны по каналам на слайдере.

# rangewide.range_available
source: Lambda range: %@ - %@ nm
ru: Диапазон λ: %@ – %@ нм

# rangewide.range_no_data
source: Lambda range: no data
ru: Диапазон λ: нет данных

# rangewide.channels_summary
source: Channels %d-%d • lambda %@-%@ nm • %d channels
ru: Каналы %d–%d • λ %@–%@ нм • %d каналов

# rangewide.range_info_with_wavelength
source: %@: ch %d-%d (lambda %@-%@ nm, %d channels)
ru: %@: ch %d–%d (λ %@–%@ нм, %d каналов)

# rangewide.range_info_channels_only
source: %@: ch %d-%d (%d channels)
ru: %@: ch %d–%d (%d каналов)

# content_view.empty_hint
source: Your ad could be here
ru: Здесь могла бы быть ваша реклама

# export.format.quick_png
source: Quick PNG
ru: Быстрый PNG

# export.format.mask_png
source: Mask PNG
ru: Маска PNG

# export.format.mask_npy
source: Mask NumPy
ru: Маска NumPy

# export.format.mask_mat
source: Mask MAT
ru: Маска MAT

# export.tab.cube
source: Hypercube
ru: Гиперкуб

# export.tab.mask
source: Mask
ru: Маска

# graph.panel.title.spectrum
source: Spectrum graph
ru: График спектра

# graph.panel.title.roi
source: ROI spectrum graph
ru: График спектра ROI

# Линейка
source: Ruler
ru: Линейка

# ruler.overlay.pixels
source: Pixels: %@ px
ru: Пиксели: %@ px

# ruler.overlay.distance
source: Distance: %@
ru: Расстояние: %@

# ruler.overlay.distance_unit
source: Distance: %@ %@
ru: Расстояние: %@ %@

# ruler.unit.m
source: m
ru: м

# ruler.unit.km
source: km
ru: км

# graph.panel.status.no_points
source: No saved points
ru: Нет сохранённых точек

# graph.panel.status.saved_points
source: Saved: %d
ru: Сохранено: %d

# graph.panel.status.no_roi
source: No saved regions
ru: Нет сохранённых областей

# graph.panel.status.roi_count
source: Regions: %d
ru: Областей: %d

# graph.panel.status.no_tool
source: No tool selected
ru: Инструмент не выбран

# graph.panel.empty.click_image
source: Click on the image
ru: Кликните на изображение

# graph.panel.empty.pixel_spectrum
source: to view pixel spectrum
ru: чтобы увидеть спектр пикселя

# graph.panel.empty.draw_roi
source: Draw a region on the image
ru: Нарисуйте область на изображении

# graph.panel.empty.roi_spectrum
source: to view ROI spectrum
ru: чтобы увидеть спектр ROI

# graph.panel.inactive.choose_tool
source: Choose a tool
ru: Выберите инструмент

# graph.panel.inactive.activate_analysis
source: Enable analysis in the top dock
ru: Активируйте анализ в доке сверху

# graph.panel.help.collapse
source: Collapse panel
ru: Свернуть панель

# graph.panel.help.expand
source: Expand panel
ru: Развернуть панель

# graph.roi.error.image_data_required
source: Image data is required for validation.
ru: Нужны данные изображения для проверки.

# graph.roi.error.x_order
source: x1 cannot be greater than x2.
ru: x1 не может быть больше x2.

# graph.roi.error.y_order
source: y1 cannot be greater than y2.
ru: y1 не может быть больше y2.

# graph.roi.error.x_range
source: x must be in range 0...%d.
ru: x должен быть в диапазоне 0...%d.

# graph.roi.error.y_range
source: y must be in range 0...%d.
ru: y должен быть в диапазоне 0...%d.

# graph.roi.error.update_failed
source: Failed to update ROI.
ru: Не удалось обновить ROI.

# graph.axis.wavelength_nm
source: lambda (nm)
ru: λ (нм)

# graph.axis.channel
source: Channel
ru: Канал

# graph.axis.intensity
source: Intensity
ru: Интенсивность

# graph.axis.series
source: Series
ru: Серия

# graph.pending.point
source: Selected point: %1$@: (%2$d, %3$d) - not saved
ru: Выбрана точка: %1$@: (%2$d, %3$d) — не сохранена

# graph.pending.roi
source: Selected region: %1$@: (%2$d, %3$d) - (%4$d, %5$d) - not saved
ru: Выбрана область: %1$@: (%2$d, %3$d) – (%4$d, %5$d) — не сохранена

# graph.action.save_point
source: Save point
ru: Сохранить точку

# graph.action.save_roi
source: Save region
ru: Сохранить область

# graph.action.rename
source: Rename
ru: Переименовать

# graph.action.edit
source: Edit
ru: Редактировать

# graph.action.delete_point
source: Delete point
ru: Удалить точку

# graph.action.delete_roi
source: Delete region
ru: Удалить область

# graph.roi.method
source: Method
ru: Метод

# graph.window.dataset.points
source: Points
ru: Точки

# graph.window.style.lines
source: Lines
ru: Линии

# graph.window.style.lines_points
source: Lines + points
ru: Линии + точки

# graph.window.style.area
source: Area
ru: Площадь

# graph.window.palette.default
source: Default
ru: Стандартная

# graph.window.palette.warm
source: Warm
ru: Тёплая

# graph.window.palette.cool
source: Cool
ru: Холодная

# graph.window.palette.mono
source: Monochrome
ru: Монохром

# graph.window.sources
source: Sources
ru: Источники

# graph.window.show_all
source: Show all
ru: Показать все

# graph.window.hide_all
source: Hide all
ru: Скрыть все

# graph.window.empty.no_saved_spectra
source: No saved spectra
ru: Нет сохранённых спектров

# graph.window.empty.add_points_roi
source: Add points or ROI on library images
ru: Добавьте точки или ROI на изображениях библиотеки

# graph.window.no_data
source: No data
ru: Нет данных

# graph.window.show_library
source: Show library
ru: Показать библиотеку

# graph.window.section.data
source: Data
ru: Данные

# graph.window.source
source: Source
ru: Источник

# graph.window.section.display
source: Display
ru: Отображение

# graph.window.line_style
source: Line style
ru: Стиль линий

# graph.window.palette
source: Palette
ru: Палитра

# graph.window.line_width
source: Line width
ru: Толщина линии

# graph.window.point_size
source: Point size
ru: Размер точек

# graph.window.section.axis_x
source: X axis
ru: Ось X

# graph.window.auto_scale
source: Auto scale
ru: Авто масштаб

# graph.window.min
source: Min
ru: Мин

# graph.window.max
source: Max
ru: Макс

# graph.window.section.axis_y
source: Y axis
ru: Ось Y

# graph.window.section.elements
source: Elements
ru: Элементы

# graph.window.show_legend
source: Show legend
ru: Показать легенду

# graph.window.show_grid
source: Show grid
ru: Показать сетку

# graph.window.title
source: Spectrum graph
ru: График спектров

# graph.window.header.series_count
source: %lld series from %lld source(s)
ru: %lld серий из %lld источн.

# graph.window.export.png_large
source: Export PNG (1800x1200)
ru: Экспорт PNG (1800×1200)

# graph.window.export.png_small
source: Export PNG (900x600)
ru: Экспорт PNG (900×600)

# graph.window.export.pdf
source: Export PDF
ru: Экспорт PDF

# graph.window.export.json
source: Export JSON
ru: Экспорт JSON

# graph.window.export
source: Export
ru: Экспорт

# graph.window.empty.no_data_to_display
source: No data to display
ru: Нет данных для отображения

# graph.window.empty.save_points_or_regions
source: Save points or regions in the graph panel
ru: Сохраните точки или области в панели графика

# graph.window.legend
source: Legend
ru: Легенда

# graph.window.points_count
source: %lld points
ru: %lld точек

# graph.window.line_shape
source: Line shape
ru: Форма линии

# graph.window.thickness
source: Thickness
ru: Толщина

# graph.window.opacity
source: Opacity
ru: Прозрачность

# graph.window.show_points
source: Show points
ru: Показывать точки

# graph.window.reset
source: Reset
ru: Сбросить

# graph.window.apply
source: Apply
ru: Применить

# graph.window.export.title
source: Export graph
ru: Экспорт графика

# graph.window.export.message
source: Choose a location to save %@
ru: Выберите место для сохранения %@

# content.export.png_channels.choose_folder_message
source: Choose a folder to save PNG channels (%@_channel_XXX.png)
ru: Выберите папку для сохранения PNG каналов (%@_channel_XXX.png)

# content.dimensions.2d
source: size: %lld x %lld
ru: размер: %lld × %lld

# content.lambda.channels_count
source: λ: %lld channels
ru: λ: %lld каналов

# content.lambda.range_brackets
source: (%@ - %@ nm)
ru: (%@ – %@ нм)

# content.mask.size
source: Mask: %lld x %lld
ru: Маска: %lld × %lld

# content.channel.wavelength_suffix
source: (%@ nm)
ru: (%@ нм)

# content.channel.current
source: Channel: %lld / %lld%@
ru: Канал: %lld / %lld%@

# content.color_mapping.channel_nm
source: %@: ch %lld (%@ nm)
ru: %@: ch %lld (%@ нм)

# content.trim.range_nm
source: Trim: %@ - %@ nm
ru: Обрезка: %@ – %@ нм

# content.trim.channels_count
source: (%lld ch.)
ru: (%lld кан.)

# content.trim.range_channel
source: Trim: channel %lld - %lld
ru: Обрезка: канал %lld – %lld

# content.lambda.step
source: Step: %@ nm
ru: Шаг: %@ нм

# content.channels_count
source: %lld channels
ru: %lld каналов

# content.lambda.range
source: %@ - %@ nm
ru: %@ – %@ нм

# content.alignment.channel
source: Channel %lld
ru: Канал %lld

# content.export.log.skip_no_data
source: Skipping %1$@ - no data for export
ru: Пропуск %1$@ — нет данных для экспорта

# content.export.log.exported
source: Exported %1$@
ru: Экспортирован %1$@

# content.export.log.error
source: Export error %1$@: %2$@
ru: Ошибка экспорта %1$@: %2$@

# PCA: спектры пикселей; lock basis сохраняет базис до смены параметров.
source: PCA: pixel spectra; lock basis keeps the basis until parameters change.
ru: PCA: спектры пикселей; lock basis сохраняет базис до смены параметров.

# assembler.title
source: HSI Assembler
ru: Сборщик ГСИ

# assembler.header.materials_count
source: Materials: %lld
ru: Материалов: %lld

# assembler.wavelength.notation.sequential
source: per line
ru: по строкам

# assembler.wavelength.not_set
source: not set
ru: не задана

# assembler.wavelength.value_nm
source: %@ nm
ru: %@ нм

# assembler.error.no_materials
source: Add materials first
ru: Сначала добавьте материалы

# assembler.error.wavelength_file_read_failed
source: Failed to read wavelength file
ru: Не удалось прочитать файл длин волн

# assembler.error.wavelength_file_empty
source: Wavelength file is empty
ru: Файл длин волн пуст

# assembler.error.mixed_notation
source: The file has mixed notations. Use one format for the whole file.
ru: В файле смешаны разные нотации. Используйте один формат на весь файл.

# assembler.error.invalid_wavelength_value_line
source: Invalid wavelength value at line %lld
ru: Некорректное значение длины волны в строке %lld

# assembler.error.wavelength_count_mismatch
source: Wavelength count (%lld) does not match materials count (%lld)
ru: Количество длин волн (%lld) не совпадает с количеством материалов (%lld)

# assembler.error.invalid_mapping_line
source: Invalid mapping row at line %lld. Expected format: name:value
ru: Некорректная строка сопоставления в строке %lld. Ожидается формат name:value

# assembler.error.no_matching_files
source: No file names matched in wavelength file
ru: В файле нет совпадений по именам материалов

# assembler.error.source_no_supported_files
source: No supported files in source
ru: В источнике нет поддерживаемых файлов

# assembler.error.source_import_failure
source: Source import error: %@
ru: Ошибка импорта источника: %@

# assembler.error.open_one_source_before_bulk
source: Open one source, configure materials, and retry bulk build
ru: Откройте один источник, настройте материалы и повторите массовую сборку

# assembler.error.duplicate_names_in_template
source: Current materials contain duplicate file names; template bulk build is unavailable
ru: В текущих материалах есть дублирующиеся имена файлов, массовая сборка по шаблону невозможна

# assembler.validation.inconsistent_resolution
source: Material sizes differ. Convert all images to one resolution.
ru: Размеры материалов различаются. Приведите все изображения к одному разрешению.

# assembler.validation.non_grayscale
source: There are color materials. Double-click "Palette" to split them into channels.
ru: Есть цветные материалы. Дважды кликните по «Палитра», чтобы разбить их на каналы.

# assembler.dialog.choose_wavelength_file
source: Choose wavelength file
ru: Выберите файл длин волн

# assembler.dialog.choose_wavelength_file_for_source
source: Choose wavelength file for '%@'
ru: Выберите файл длин волн для '%@'

# assembler.alert.empty_source_message
source: Folder '%@' has no PNG/JPG/BMP files. Remove this source from the list?
ru: В папке '%@' нет PNG/JPG/BMP файлов. Удалить этот источник из списка?

# assembler.action.add
source: Add
ru: Добавить

# assembler.action.import
source: Import
ru: Импортировать

# assembler.action.load
source: Load
ru: Загрузить

# assembler.progress.preparing
source: Preparing…
ru: Подготовка…

# assembler.progress.bulk_building
source: Bulk build…
ru: Массовая сборка…

# assembler.progress.importing
source: Importing…
ru: Импорт…

# assembler.progress.import
source: Import: %lld/%lld
ru: Импорт: %lld/%lld

# assembler.info.sources_added
source: Sources added: %lld
ru: Добавлено источников: %lld

# assembler.info.opening_source
source: Opening source '%@'…
ru: Открывается источник '%@'…

# assembler.info.no_sources_for_bulk
source: No sources for bulk build
ru: Нет источников для массовой сборки

# assembler.info.bulk_completed
source: Bulk build completed: success %lld, skipped %lld
ru: Массовая сборка завершена: успешно %lld, пропущено %lld

# assembler.failure.duplicate_names
source: %@: duplicate file names found
ru: %@: есть дублирующиеся имена файлов

# assembler.failure.missing_file
source: %@: missing file %@
ru: %@: отсутствует файл %@

# assembler.failure.no_matching_txt
source: %@: no matching wavelength txt found
ru: %@: нет подходящего txt с длинами волн

# assembler.info.wavelengths_loaded_updated
source: Wavelengths loaded: %lld materials updated
ru: Длины волн загружены: обновлено %lld материалов

# assembler.info.no_new_files_for_import
source: No new files to import
ru: Новых файлов для импорта нет

# assembler.info.files_added_partial
source: Added: %lld. Some files were skipped
ru: Добавлено: %lld. Часть файлов пропущена

# assembler.info.files_added
source: Files added: %lld
ru: Добавлено файлов: %lld

# assembler.info.applied_wavelength_file
source: Applied wavelength file: %@ (%lld)
ru: Применён файл длин волн: %@ (%lld)

# assembler.info.new_hsi_added
source: New HSI added to library: %@
ru: Новый ГСИ добавлен в библиотеку: %@

# assembler.info.materials_sorted_by_wavelength
source: Materials sorted by wavelengths
ru: Материалы отсортированы по длинам волн

# assembler.info.material_split_channels
source: %@ was split into channels
ru: %@ разбит на каналы

# export.tiff.envi_info
source: The file will be saved as one interleaved TIFF (Photometric: minisblack, PlanarConfig: contig).
ru: Файл будет сохранён как один TIFF с interleaved каналами (Photometric: minisblack, PlanarConfig: contig).
