Repository: Liptee/HSIViewer
Catalog: HSIView/*.lproj/Localizable.strings
Languages: ru

# export.tiff.default_info
source: By default, each channel is exported as a separate TIFF frame.
ru: По умолчанию каждый канал экспортируется отдельным кадром TIFF.

# export.mask.format.png_color_info
source: Color PNG with class colors for visualization.
ru: Цветной PNG с цветами классов. Для визуализации.

# export.mask.format.png_grayscale_info
source: Single-channel PNG (grayscale). Pixel values are class IDs.
ru: Одноканальный PNG (grayscale). Значения пикселей = номера классов.

# export.mask.format.npy_info
source: NumPy HxW uint8 array. Values are class IDs (0 = background).
ru: NumPy массив HxW uint8. Значения = номера классов (0 = фон).

# export.mask.format.mat_info
source: MATLAB format with mask and class metadata.
ru: MATLAB формат с маской и метаданными классов.

# export.library.empty_hint
source: Library is empty. Add files or disable library export.
ru: Библиотека пуста. Добавьте файлы или выключите опцию экспорта библиотеки.

# export.library.will_export_files
source: %lld files will be exported. Saved processing from the library is used for each file.
ru: Будет экспортировано %lld файлов. Для каждого используется сохранённая обработка из библиотеки.

# export.format.npy_info
source: NumPy format. Preserves data type and order (C/Fortran). Compatible with Python/NumPy.
ru: NumPy формат. Сохраняет тип данных и порядок (C/Fortran). Совместим с Python/NumPy.

# export.format.mat_info
source: MATLAB format. Preserves data type. Compatible with MATLAB/Octave. Data is column-major.
ru: MATLAB формат. Сохраняет тип данных. Совместим с MATLAB/Octave. Данные в column-major порядке.

# export.format.tiff_info
source: Export all channels into a single multi-frame TIFF file.
ru: Экспорт всех каналов в один многокадровый TIFF файл.

# export.format.envi_dat_info
source: Export ENVI pair: .dat + .hdr. Configure HDR metadata and binary layout.
ru: Экспорт пары ENVI: .dat + .hdr. Можно настроить HDR-метаданные и бинарную раскладку.

# export.format.envi_raw_info
source: Export ENVI pair: .raw + .hdr. Configure HDR metadata and binary layout.
ru: Экспорт пары ENVI: .raw + .hdr. Можно настроить HDR-метаданные и бинарную раскладку.

# export.format.png_channels_info
source: Export channels as separate PNG files into the selected folder. All data types are scaled automatically.
ru: Экспорт каналов как отдельные PNG изображения в выбранную папку. Все типы данных автоматически масштабируются.

# export.format.quick_png_info
source: Quick export of RGB image with selected color synthesis mode.
ru: Быстрый экспорт RGB изображения с выбранным режимом цветосинтеза.

# export.color_synthesis.needs_wavelengths
source: Wavelengths are required for correct color synthesis.
ru: Для корректного цветосинтеза необходимо задать длины волн.

# export.mat.variable_name_info
source: Variable name in MAT file (for example: 'data', 'cube', 'hypercube').
ru: Имя переменной в MAT файле (например: 'data', 'cube', 'hypercube').

# export.mat.wavelengths_as_variable_info
source: Wavelengths will be saved as variable '%@_wavelengths' in the same MAT file.
ru: Wavelengths будут сохранены как переменная '%@_wavelengths' в том же MAT файле.

# export.mat.wavelengths_separate_txt_info
source: Wavelengths will be saved in a separate .txt file.
ru: Wavelengths будут сохранены в отдельный .txt файл.

# export.wavelengths.extra_file_per_line
source: An additional '_wavelengths.txt' file with %lld wavelengths will be created (one value per line).
ru: Будет создан дополнительный файл '_wavelengths.txt' с %lld длинами волн (по одному значению на строку).

# export.wavelengths.extra_file
source: An additional '_wavelengths.txt' file with %lld wavelengths will be created.
ru: Будет создан дополнительный файл '_wavelengths.txt' с %lld длинами волн.

# export.wavelengths.base_file
source: A '%@_wavelengths.txt' file with %lld wavelengths will be created.
ru: Будет создан файл '%@_wavelengths.txt' с %lld длинами волн.

# export.wavelengths.envi_hdr
source: Wavelengths will be written to the 'wavelength' field in the .hdr file.
ru: Длины волн будут записаны в поле 'wavelength' файла .hdr.

# export.wavelengths.missing_hint
source: Wavelengths are missing. Generate them in the control panel (Start/Step) before export.
ru: Длины волн отсутствуют. Сгенерируйте их в панели управления (Start/Step) перед экспортом.

# export.cube.open_or_enable_library
source: Open a hypercube or enable full library export.
ru: Открой гиперкуб или включите экспорт всей библиотеки.

# export.error.library_empty
source: Library is empty
ru: Библиотека пуста

# export.error.open_cube
source: Open a hypercube for export
ru: Открой гиперкуб для экспорта

# export.error.no_mask
source: No mask available for export
ru: Нет маски для экспорта

# export.envi.options.title
source: ENVI HDR options
ru: Параметры ENVI HDR

# export.envi.binary_type.dat
source: .dat (ENVI data)
ru: .dat (данные ENVI)

# export.envi.binary_type.raw
source: .raw (sensor RAW style)
ru: .raw (формат RAW сенсора)

# export.envi.interleave
source: Interleave
ru: Способ чередования

# export.envi.data_type
source: Data type
ru: Тип данных

# export.envi.byte_order
source: Byte order
ru: Порядок байтов

# export.envi.byte_order.little
source: Little endian (0)
ru: Младший байт первым (0)

# export.envi.byte_order.big
source: Big endian (1)
ru: Старший байт первым (1)

# export.envi.file_type
source: File type
ru: Тип файла

# export.envi.sensor_type
source: Sensor type
ru: Тип сенсора

# export.envi.description
source: Description
ru: Описание

# export.envi.default_bands.include
source: Write default bands (RGB)
ru: Записывать каналы по умолчанию (RGB)

# export.envi.default_bands.mode.color_synthesis
source: From current color synthesis
ru: Из текущего цветосинтеза

# export.envi.default_bands.mode.specim
source: SPECIM preset (70/53/19)
ru: Пресет SPECIM (70/53/19)

# export.envi.default_bands.mode.custom
source: Custom
ru: Пользовательские

# export.envi.acquisition_date.include
source: Write acquisition date
ru: Записывать дату съёмки

# export.envi.coordinates.include
source: Write latitude/longitude
ru: Записывать широту/долготу

# export.envi.georef.include
source: Write geo-referencing (map info)
ru: Записывать геопривязку (map info)

# export.envi.georef.info
source: If geo-referencing exists in the cube, 'map info', 'x start', and 'y start' will be written to .hdr.
ru: Если в кубе есть геопривязка, в .hdr будут записаны поля 'map info', 'x start' и 'y start'.

# export.envi.latitude
source: Latitude
ru: Широта

# export.envi.longitude
source: Longitude
ru: Долгота

# export.envi.wavelength_units
source: Wavelength units
ru: Единицы длины волны

# export.envi.additional_fields
source: Additional HDR fields
ru: Дополнительные поля HDR

# export.envi.additional_fields.hint
source: One field per line: key = value. Reserved keys are ignored.
ru: По одному полю на строку: key = value. Зарезервированные ключи игнорируются.

# export.envi.options.info
source: Required ENVI fields are generated automatically. Optional fields help preserve sensor metadata.
ru: Обязательные поля ENVI формируются автоматически. Дополнительные поля помогают сохранить метаданные сенсора.

# export.envi.error.invalid_layout
source: Failed to resolve cube layout for ENVI export
ru: Не удалось определить раскладку (layout) куба для экспорта ENVI

# export.envi.error.failed_to_create_file
source: Failed to create file: %@
ru: Не удалось создать файл: %@

# export.envi.error.invalid_additional_field_line
source: Invalid additional HDR field at line %d
ru: Некорректное дополнительное поле HDR в строке %d

# mask.brush_size_px
source: Brush size: %lld px
ru: Размер кисти: %lld px

# graph.roi.image_size_px
source: Image size: %lld x %lld px
ru: Размер изображения: %lld × %lld px

# Включить рисование
source: Enable drawing
ru: Включить рисование

# Отключить рисование
source: Disable drawing
ru: Отключить рисование

# Добавить слой маски
source: Add mask layer
ru: Добавить слой маски

# Слои
source: Layers
ru: Слои

# Инструменты
source: Tools
ru: Инструменты

# Действия
source: Actions
ru: Действия

# Подсказки
source: Hints
ru: Подсказки

# Заблокировать
source: Lock
ru: Заблокировать

# Разблокировать
source: Unlock
ru: Разблокировать

# Переместить вверх
source: Move up
ru: Переместить вверх

# Переместить вниз
source: Move down
ru: Переместить вниз

# Прозрачность:
source: Opacity:
ru: Прозрачность:

# Отменить (⌘Z)
source: Undo (⌘Z)
ru: Отменить (⌘Z)

# ↑↓ для изменения порядка слоёв
source: Use ↑↓ to change layer order
ru: ↑↓ для изменения порядка слоёв

# • Shift — показать только активный слой
source: • Shift - show only active layer
ru: • Shift — показать только активный слой

# • ⌘Z — отмена последнего действия
source: • ⌘Z - undo last action
ru: • ⌘Z — отмена последнего действия

# • File → Экспорт для сохранения маски
source: • File -> Export to save mask
ru: • File → Экспорт для сохранения маски

# Нет данных
source: No data
ru: Нет данных

# pipeline.setting.current
source: Setting: %@
ru: Настройка: %@

# pipeline.alignment.estimated_time
source: Estimated time: %@
ru: Ожидаемое время: %@

# pipeline.alignment.channel_progress
source: Channel %lld/%lld
ru: Канал %lld/%lld

# pipeline.alignment.elapsed
source: Elapsed: %@
ru: Прошло: %@

# pipeline.alignment.remaining
source: Remaining: %@
ru: Осталось: %@

# pipeline.alignment.cache_mismatch
source: Cache has %lld homographies, image has %lld channels. Recalculation will be performed on apply.
ru: Кэш содержит %lld гомографий, а изображение имеет %lld каналов. При применении будет выполнен пересчёт.

# pipeline.trim.channel_range_total
source: Channel range: 0-%lld (%lld total)
ru: Диапазон каналов: 0–%lld (%lld всего)

# pipeline.trim.lambda_range
source: Lambda range: %@ - %@ nm
ru: Диапазон λ: %@ – %@ нм

# pipeline.trim.remaining_channels
source: Will remain: %lld channels
ru: Останется: %lld каналов

# pipeline.trim.current_channels
source: Current trim: channels %lld - %lld
ru: Текущая обрезка: каналы %lld – %lld

# pipeline.trim.will_clip_to_lambda
source: Will be clipped to lambda %@ - %@ nm
ru: Будет обрезано до λ %@ – %@ нм

# pipeline.trim.nearest_channels
source: Nearest channels: %lld - %lld (lambda %@ - %@ nm)
ru: Ближайшие каналы: %lld – %lld (λ %@ – %@ нм)

# pipeline.transpose.source_layout
source: Source: %@
ru: Источник: %@

# pipeline.transpose.result_layout
source: Result: %@
ru: Результат: %@

# pipeline.transpose.after_apply_layout
source: After apply, displayed layout will switch to %@.
ru: После применения отображаемый layout переключится на %@.

# pipeline.transpose.normalized_input
source: Normalized input: %@
ru: Нормализованный ввод: %@

# pipeline.spectral_interp.loaded_wavelengths
source: Loaded %lld wavelengths from %@
ru: Загружено %lld длин волн из %@

# pipeline.spectral_interp.source_range
source: Source range: %.2f - %.2f nm
ru: Исходный диапазон: %.2f – %.2f нм

# pipeline.spectral_interp.invalid_wavelength_line
source: Invalid wavelength value at line %d
ru: Некорректная длина волны в строке %d

# pipeline.alignment.homographies_saved
source: Homographies saved: %@
ru: Гомографии сохранены: %@

# pipeline.alignment.homographies_loaded
source: Homographies loaded from %@
ru: Гомографии загружены из %@

# pipeline.crop.size_px
source: %1$d x %2$d px
ru: %1$d × %2$d px

# pipeline.resize.aspect_ratio_preserved
source: Aspect ratio to preserve: %.3f
ru: Будет сохранено соотношение: %.3f

# pipeline.spectral_interp.file_channels_range
source: From file: %1$d channels, %2$.2f - %3$.2f nm
ru: Из файла: %1$d каналов, %2$.2f – %3$.2f нм

# app.assembly.error.inconsistent_resolution
source: Resolution %1$@ (%2$@) does not match expected %3$@
ru: Разрешение %1$@ (%2$@) не совпадает с ожидаемым %3$@

# app.assembly.error.non_grayscale_material
source: Material %1$@ is not Grayscale. Split it into channels.
ru: Материал %1$@ не в Grayscale. Разбейте его на каналы.

# app.assembly.error.invalid_wavelength_at_index
source: Invalid wavelength at material #%d
ru: Некорректная длина волны у материала №%d

# app.assembly.error.invalid_material_data
source: Corrupted material data: %@
ru: Повреждённые данные материала: %@

# app.time.seconds
source: %d sec
ru: %d сек

# app.time.minutes_seconds
source: %d min %d sec
ru: %d мин %d сек

# app.time.hours_minutes
source: %d h %d min
ru: %d ч %d мин

# app.wdvi.estimation_result
source: WDVI estimation: a=%1$@, b=%2$@ from %3$d pixels
ru: Оценка WDVI: a=%1$@, b=%2$@ по %3$d пикселям

# app.wavelength.read_error
source: Wavelength read error: %@
ru: Ошибка чтения длин волн: %@

# app.wavelength.paste_count_mismatch_for_entry
source: Failed to paste wavelengths into %@: channel count mismatch
ru: Не удалось вставить длины волн в %@: не совпадает количество каналов

# app.wavelength.not_applied_entries
source: Wavelengths not applied: %@
ru: Длины волн не применены: %@

# pipeline.alignment.reference_lambda
source: lambda = %.1f nm
ru: λ = %.1f нм

# pipeline.alignment.average_metric
source: Avg. %1$@: %2$@
ru: Ср. %1$@: %2$@

# pipeline.alignment.apply_cached_for_channels
source: Applying to an image with %d channels will use cached parameters without recalculation.
ru: При применении к изображению с %d каналами будут использованы сохранённые параметры без пересчёта.

# pipeline.auto_crop.candidate_estimate
source: Candidate estimate: ~%d (depends on limits and step)
ru: Оценка вариантов: ~%d (зависит от ограничений и шага)

# pipeline.auto_crop.best_result
source: Best result: %1$@=%2$@, window %3$dx%4$d, evaluated %5$d
ru: Лучший результат: %1$@=%2$@, окно %3$dx%4$d, проверено %5$d

# pipeline.calibration.white_ref_scan_size_mismatch
source: White REF does not match scan size (%d px).
ru: REF белого не совпадает с размером скана (%d px).

# pipeline.calibration.black_ref_scan_size_mismatch
source: Black REF does not match scan size (%d px).
ru: REF чёрного не совпадает с размером скана (%d px).

# pipeline.auto_crop.source_channels_out_of_range
source: Source channels are out of valid range 0...%d
ru: Каналы source вне допустимого диапазона 0...%d

# pipeline.auto_crop.reference_channels_out_of_range
source: Reference channels are out of range 0...%d
ru: Каналы reference вне диапазона 0...%d

# pipeline.auto_crop.area_found
source: Area found: %1$dx%2$d, %3$@=%4$@, evaluated %5$d
ru: Найдена область: %1$dx%2$d, %3$@=%4$@, проверено %5$d

# Сохранять соотношение сторон референса
source: Save reference aspect ratio
ru: Сохранять соотношение сторон референса

# Допустимое отклонение соотношения сторон (%)
source: Allowed aspect ratio deviation (%)
ru: Допустимое отклонение соотношения сторон (%)

# Раннее отсечение кандидатов (MSE)
source: Early candidate pruning (MSE)
ru: Раннее отсечение кандидатов (MSE)

# pipeline.alignment.error.unsupported_version
source: Unsupported file version: %d
ru: Неподдерживаемая версия файла: %d

# pipeline.alignment.error.invalid_layout
source: Unknown layout in file: %@
ru: Неизвестный layout в файле: %@

# pipeline.alignment.error.invalid_method
source: Unknown optimization method: %@
ru: Неизвестный метод оптимизации: %@

# pipeline.alignment.error.invalid_metric
source: Unknown metric: %@
ru: Неизвестная метрика: %@

# pipeline.alignment.error.invalid_reference_channel
source: Reference channel %d is out of range 0...%d
ru: Эталонный канал %d вне диапазона 0...%d

# pipeline.alignment.error.invalid_homography
source: Invalid homography matrix for channel %d
ru: Некорректная матрица гомографии для канала %d

# pipeline.alignment.error.layout_mismatch
source: Layout mismatch: file %1$@, current cube %2$@
ru: Layout не совпадает: в файле %1$@, в текущем кубе %2$@

# pipeline.alignment.error.spatial_mismatch
source: Spatial properties mismatch: file %1$@, current cube %2$@
ru: Пространственные характеристики не совпадают: файл %1$@, текущий куб %2$@

# pipeline.alignment.error.channels_mismatch
source: Channel count mismatch: file %1$d, current cube %2$d
ru: Число каналов не совпадает: файл %1$d, текущий куб %2$d

# pipeline.alignment.error.wavelength_count_mismatch
source: Wavelength count mismatch: file %1$d, current cube %2$d
ru: Число длин волн не совпадает: файл %1$d, текущий куб %2$d

# pipeline.alignment.error.wavelength_mismatch
source: Spectral properties differ (channel %d)
ru: Спектральные характеристики отличаются (канал %d)

# pipeline.alignment.reference_channel_with_lambda
source: %1$d (lambda=%2$.1f nm)
ru: %1$d (λ=%2$.1f нм)

# pipeline.time.about_seconds
source: ~%d sec
ru: ~%d сек

# pipeline.time.about_minutes_seconds
source: ~%d min %d sec
ru: ~%d мин %d сек

# pipeline.time.about_hours_minutes
source: ~%d h %d min
ru: ~%d ч %d мин

# pipeline.operation.display.rotation
source: Rotation %1$@
ru: Поворот %1$@

# pipeline.operation.display.transpose_to
source: Transpose to %1$@
ru: Транспонирование в %1$@

# pipeline.operation.display.resize_to
source: Resize to %1$dx%2$d (%3$@)
ru: Ресайз до %1$dx%2$d (%3$@)

# pipeline.operation.details.invalid_order
source: Order: %1$@ (invalid)
ru: Порядок: %1$@ (некорректно)

# pipeline.operation.details.resize_to
source: To %1$dx%2$d, %3$@
ru: До %1$dx%2$d, %3$@

# pipeline.operation.details.auto_metric
source: • auto %1$@: %2$@
ru: • авто %1$@: %2$@

# pipeline.operation.details.channels_range_count
source: channels %1$d-%2$d (%3$d)
ru: каналы %1$d–%2$d (%3$d)

# pipeline.operation.details.spectral_interp_file_channels
source: %1$d channels (txt), %2$@
ru: %1$d каналов (txt), %2$@

# pipeline.operation.details.spectral_interp_channels
source: %1$d channels, %2$@
ru: %1$d каналов, %2$@

# pipeline.operation.details.spectral_alignment_status
source: %1$@ channel %2$d, %3$@
ru: %1$@ канал %2$d, %3$@

# pipeline.calibration.ref_channels_mismatch
source: REF does not match channel count (%d)
ru: REF не совпадает с числом каналов (%d)

# pipeline.sample.point_name
source: Point (%1$d, %2$d)
ru: Точка (%1$d, %2$d)

# pipeline.alignment.progress.extract_reference_channel
source: Extracting reference channel %d…
ru: Извлечение референсного канала %d…

# pipeline.alignment.progress.channel_extract_data
source: Channel %1$d/%2$d: extracting data
ru: Канал %1$d/%2$d: извлечение данных

# pipeline.alignment.progress.channel_search_homography
source: Channel %1$d/%2$d: searching homography
ru: Канал %1$d/%2$d: поиск гомографии

# pipeline.alignment.progress.channel_metric_score
source: Channel %1$d/%2$d: %3$@ = %4$@
ru: Канал %1$d/%2$d: %3$@ = %4$@

# pipeline.alignment.progress.apply_homographies_to_channels
source: Applying homographies to %d channels…
ru: Применение гомографий к %d каналам…

# pipeline.alignment.progress.completed_average
source: Completed! Average %1$@: %2$@
ru: Завершено! Средний %1$@: %2$@

# pipeline.alignment.error.already_in_progress
source: Wait until the current alignment computation finishes
ru: Дождитесь завершения текущего вычисления выравнивания

# content.alignment.processing.title
source: Homography search
ru: Поиск гомографий

# pipeline.auto_crop.progress.iteration
source: Crop search: %1$@=%2$@
ru: Перебор обрезок: %1$@=%2$@

# loader.envi.hdr_not_found
source: .hdr file not found: %@
ru: Не найден .hdr файл: %@

# loader.envi.binary_not_found_expected
source: Binary file not found. Expected: %@
ru: Не найден бинарный файл. Ожидается: %@

# loader.envi.binary_read_failed
source: Failed to read binary file: %@
ru: Не удалось прочитать бинарный файл: %@

# export.error.write_with_message
source: Write error: %@
ru: Ошибка записи: %@

# export.mat.error.failed_with_message
source: MAT export error: %@
ru: Ошибка экспорта в MAT: %@

# export.mat.error.write_wavelength_file
source: Failed to write wavelength file: %@
ru: Не удалось записать файл длин волн: %@

# image_load.error.unsupported_format
source: Unsupported format: %@
ru: Неподдерживаемый формат: %@

# image_load.error.read_details
source: Read error: %@
ru: Ошибка чтения: %@

# mask.import.busy
source: Importing mask…
ru: Импорт маски…

# mask.import.error.no_cube
source: Open an HSI cube before importing a mask.
ru: Сначала откройте ГСИ перед импортом маски.

# mask.import.error.spatial_size_unavailable
source: Unable to determine the spatial size of the current image.
ru: Не удалось определить пространственный размер текущего изображения.

# mask.import.error.unsupported_format
source: Unsupported mask format: %@
ru: Неподдерживаемый формат маски: %@

# mask.import.error.read_details
source: Mask import error: %@
ru: Ошибка импорта маски: %@

# mask.import.error.size_mismatch
source: Mask size %1$@ does not match image size %2$lldx%3$lld.
ru: Размер маски %1$@ не совпадает с размером изображения %2$lldx%3$lld.

# mask.import.error.invalid_class_value
source: Invalid class value: %@. Only integer values in the range 0...255 are supported.
ru: Некорректное значение класса: %@. Поддерживаются только целые значения в диапазоне 0...255.

# mask.import.error.png_read
source: Failed to read PNG mask.
ru: Не удалось прочитать PNG маску.

# mask.import.error.npy_read
source: Failed to read NumPy mask.
ru: Не удалось прочитать NumPy маску.

# mask.import.error.mat.list_failed
source: Failed to read variables from MAT file.
ru: Не удалось прочитать переменные из MAT файла.

# mask.import.error.mat.no_matching_2d
source: MAT file does not contain a 2D mask of size %1$lldx%2$lld.
ru: MAT файл не содержит 2D маску размера %1$lldx%2$lld.

# mask.import.error.mat.variable_load_failed
source: Failed to load MAT variable: %@
ru: Не удалось загрузить переменную MAT: %@

# mask.import.error.mat.unsupported_type
source: Unsupported MAT data type for mask import.
ru: Неподдерживаемый тип данных MAT для импорта маски.

# mask.class_name_numbered
source: Class %d
ru: Класс %d
